# Задача 1: 
# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# Решение:
# i = int(input('Введите 3-значное число --> ' ))
# sum=(i%10 + ((i-i%10)/10)%10 + i//100)
# print(sum)

# Задача 2: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# Решение (под табом просто логика):
    # Pe+Ka+Se=S
    # Pe==Se = x
    # Ka=(Pe+Se)*2 = 4*x
    # S=x+4*x+x
    # x=S/6
# i = int(input('Введите число журавликов, сделанное 3мя детьми --> ' ))
# print('Петя: ', i/6, ', Катя: ',(i/6)*4, ', Сережа: ', i/6)

# Задача 3: Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

# Решение:
# num = int(input('Введите 6-значный номер билета --> ' ))
# l=num//1000
# r=num-l*1000
# sum_left=(l%10 + ((l-l%10)/10)%10 + l//100)
# sum_right=(r%10 + ((r-r%10)/10)%10 + r//100)
# print('Lucky!' if sum_left==sum_right else 'next time maybe?)')

# Задача 4: Требуется определить, можно ли от шоколадки размером n × m долек 
# отломить k долек, если разрешается сделать один разлом по прямой между дольками
#  (то есть разломить шоколадку на два прямоугольника).
# 3 2 4 -> yes
# 3 2 1 -> no

# Решение:
# len = int(input('Введите число долек в длине шоколадки--> ' ))
# wid = int(input('Введите число долек в ширине шоколадки--> ' ))
# want = int(input('Введите число долек, которое хотите отломить одним махом --> ' ))
# print('YES' if ((want%len==0) or (want%wid==0)) else 'No way')