# Задача 22: 
# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются 
# в обоих наборах. Пользователь вводит 2 числа. n - кол-во элементов первого множества. 
# m - кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.
# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# 6 12

# len_list_1=int(input('Введите размер 1го набора элементов: '))
# len_list_2=int(input('Введите размер 2го набора элементов: '))
# list_1=[]
# list_2=[]
# print('Введите 1й набор элементов: ')
# for i in range(len_list_1):
#     list_1.append(int(input()))
# print('Введите 2й набор элементов: ')
# for i in range(len_list_2):
#     list_2.append(int(input()))
# print('Числа, встречающиеся в обоих наборах: ', set(list_1).intersection(set(list_2)))

# Задача 24: 
# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, 
# причем кусты высажены только по окружности. Таким образом, у каждого куста 
# есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.
# 4 -> 1 2 3 4
# 9

# plants=int(input('Введите число кустов: '))
# berries=[]
# print('Введите урожайность каждого куста (число ягод): ')
# for i in range(plants):
#     berries.append(int(input()))
# max_berries=0
# if plants>3:
#     berries_count=berries[-1:] + berries[:] + berries[:1]
#     for i in range(plants):
#         if (berries_count[i]+berries_count[i+1]+berries_count[i+2])>max_berries:
#             max_berries=berries_count[i]+berries_count[i+1]+berries_count[i+2]
# else:
#     for i in range(plants):
#         max_berries+=berries[i]
# print('за один подход машина может собрать ',max_berries, 'ягод')