# Задача 30: 
# Заполните массив элементами арифметической прогрессии. Её первый элемент, 
# разность и количество элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15

# a1=int(input('введите первое число прогрессии: '))
# step=int(input('введите шаг прогрессии: '))
# n=int(input('введите нужное количество эл-тов прогрессии: '))
# your_list=[a1+(i-1)*step for i in range(1,n+1)]
# print(your_list)

# Задача 32: 
# Определить индексы элементов массива (списка), значения которых принадлежат 
# заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# диапазон от 7 до 10
# Вывод: [1, 9, 13, 14, 19]

# def fill_list(num):
#     print('заполните список:')
#     list=[]
#     for i in range(num):
#         list.append(int(input('-> ')))
#     return list
# n=int(input('введите число элементов списка: '))
# miin=int(input('введите нижнюю границу фильтра: '))
# maax=int(input('введите верхнюю границу фильтра: '))
# your_list=fill_list(n)
# res_list=[i for i in range(n) if your_list[i]>=miin and your_list[i]<=maax]
# print(res_list)