# Задача 34: 
# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться 
# в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит 
# написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
# в порядке
# Ввод: 
# пара-ра-рам рам-пам-папам па-ра-па-дам
# Вывод:
# Парам пам-пам

# как это сделать без циклов и с чем-то из map/filter/lambda я не поняла...
# vowels=['а' ,'е', 'ё', 'и', 'о', 'у', 'э', 'ю', 'я', 'ы']
# def vinni(list):
#     slogi=[]
#     for word in list:
#         count=0
#         for letter in word:
#             if len(set(letter).intersection(set(vowels)))==1:
#                 count+=1
#         slogi.append(count)
#     return 'Парам пам-пам! 8-)' if len(set(slogi))==1 else 'Пам парам... 8-('
# print('Привет, Винни!')
# print('Пиши скорей свою кричалку/сопелку/пыхелку:')
# pyh=list(input().split())
# print(vinni(pyh))



# Задача 36: 
# Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6),
# которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и
# столбца. Аргументы num_rows и num_columns указывают число строк и столбцов таблицы,
# которые должны быть распечатаны. Нумерация строк и столбцов идет с единицы (подумайте,
# почему не с нуля). Примечание: бинарной операцией называется любая операция, у которой
# ровно два аргумента, как, например, у операции умножения.
# Ввод:
# print_operation_table(lambda x, y: x * y) 
# Вывод:
# 1 2 3 4 5 6
# 2 4 6 8 10 12
# 3 6 9 12 15 18
# 4 8 12 16 20 24
# 5 10 15 20 25 30
# 6 12 18 24 30 36 

# def print_operation_table(function, raws, columns):
#     for i in range(1,(raws+1)):
#         print('')
#         for j in range(1,columns+1):
#             print(function(i,j), end =" ")
# # print_operation_table(lambda x, y: x * y, 6, 6)
# user_raw=int(input('сколько строк в таблице показать? '))
# user_col=int(input('сколько столбцов в таблице показать? '))
# while True:
#     print('')
#     print('Какую функцию хотите посмотреть? Выберите номер: ')
#     print('1 - x*y')
#     print('2 - x+y (но тогда сам пойми, в какой строке что складывается)')
#     print('3 - не хочу! уйди, противный!')
#     num=int(input())
#     if num==1:
#         print('Пожалуйста:')
#         print_operation_table(lambda x, y: x * y, user_raw, user_col)
#     if num==2:
#         print('Пожалуйста:')
#         print_operation_table(lambda x, y: x + y, user_raw, user_col)
#     if num==3:
#         print('сам такой!')
#         break
